<template>
    <AdminModel
        v-model="flag"
        class="cares-service-model vat-service-model"
    >
       <div class="vat-service-container block">
            <h3>VAT服务产品服务协议</h3>  
            <p >欢迎使用VAT服务产品（以下简称“VAT服务”）。本协议是凯蓝仕金融服务（深圳）有限公司及其关联方（以下合称“CaresPAY”）与用户（以下简称“您”）就使用VAT服务相关事宜所订立的协议。</p>
            <p >为使用VAT服务的服务，您应当阅读并遵守《VAT服务产品服务协议》（以下简称“本协议”）。在接受本协议之前，请您仔细阅读本协议的全部内容。如您不同意本协议的任意内容，或者无法准确理解该条款的，请与CaresPAY客服人员联系（客服电话：400-887-0201），并不要进行操作。您通过网络页面点击确认，即表示您同意接受本协议的全部约定内容以及本协议有关的已经发布或者将来可能发布的各项规则、页面展示、操作流程、公告或通知（以下合称“规则”），且CaresPAY有权利随时修改本协议和规则的内容并立即生效。</p>
            <p >一. 产品内容</p>
            <p >1.1 VAT服务为增值税一站式服务工具，您可以根据实际需要使用VAT服务项下的VAT注册、VAT报税、VAT缴税等服务，具体服务内容如下：</p>
            <div class="importance">
                <p>1.1.1 VAT注册：协助您向当地税务局申请增值税注册的服务。</p>
                <p>1.1.2 VAT报税：协助您编制、审查并提交日常增值税申报单、国际贸易统计申报单和欧盟销售清单的服务。</p>
                <p>1.1.3 VAT缴税：协助您向当地税务局缴纳增值税款项的服务。</p>
            </div>
            <p>上述三种服务相对独立，互不影响，您可根据您的实际情况选择相应的服务。</p>
            <p>1.2 VAT服务的服务流程如下：</p>
            <p>1.2.1 VAT注册</p>
            <div class="importance">
               <p>I.申请提交：您在VAT注册用户界面提交申请后，选择报税国家，填写公司名称、公司地址、法定代表人姓名、邮箱地址等信息，而后按照CaresPAY要求提供所需资料。</p>
               <p>II.费用支付：提交注册申请后，您须支付本次注册服务费。</p>
               <p>III.资料审核：CaresPAY将在您支付注册服务费后进行资料审核。</p>
               <p>IV.资料提供：资料审核通过后，您须提供所需全部资料原件和复印件。</p>
               <p>V.凭证提供：您的资料将被提交当地税务局审批；当地税务局审批通过后出具相关税号证书。</p>
            </div>
            <p>1.2.2 VAT报税</p>
            <div class="importance">
                <p>I.申请提交：您在VAT报税用户界面提交申请后，选择报税国家、报税店铺等信息，并按照CaresPAY要求提供所需资料。</p>
                <p>II.费用支付：提交报税申请后，您须支付本次报税服务费（如果您选择注册+报税服务，您的VAT报税服务费在注册时已经支付，无需另外支付）。</p>
                <p>III.资料审核：CaresPAY将在您支付报税服务费后进行资料审核。</p>
                <p>IV.资料提供：资料审核通过后，您须在增值税和其他法定申报单的提交截至日期前，至少15（十五）个工作日向CaresPAY提供所需全部资料的原件及复印件。</p>
                <p>V.凭证提供：您的资料将被提交当地税务局审批；当地税务局审批通过后出具相关申报回执。</p>
            </div>
            <p>1.2.3 VAT缴税</p>
            <p>您在VAT缴税用户界面选择缴税店铺、缴税国家，填写VAT注册号、应缴税额等相关信息，上传相关凭证后，提交确认缴税申请即可。</p>
            <p>1.3 当地税务局出具相应的税号证书、申报回执或缴税回执，即表示该次全部服务已经完成。</p>
            <p>二、服务费用</p>
            <p>2.1 服务费</p>
            <div class="importance">
                <p>使用VAT服务中的VAT注册、VAT报税时，您须支付相应的服务费。服务费以您使用VAT服务时CaresPAY公布的服务费金额为准。</p>
            </div>
            <p>2.2 服务费支付方式</p>
            <div class="importance">
                <p>您同意CaresPAY根据您的操作指示扣除您使用VAT服务所产生的全部服务费。</p>
            </div>
            <p>2.3 服务费用退还</p>
            <div class="importance">
                <p>如您提交的资料未通过当地税务局审批，CaresPAY将退还相应的服务费用。</p>
            </div>
            <p>2.4 您了解使用VAT服务时，您须提交所需全部资料的原件和复印件，您同意自行承担资料提供所产生全部费用，CaresPAY任何情况下均不承担此类费用。</p>
            <p>2.5 CaresPAY可能根据实际需要对VAT服务的服务费、支付方式进行修改和变更，如您不同意上述修改或变更内容，应立即停止使用VAT服务。</p>
            <p>三、免责条款</p>
            <p>3.1 您在使用VAT服务时，您须保证每次提交的资料的准确性、真实性及合法性；若您违反前述保证而导致的损失，CaresPAY对此不承担任何责任。</p>
            <p>3.2 您在使用VAT服务时，您须根据CaresPAY要求提交所需全部资料；您未及时提交全部资料而导致的损失由您承担，CaresPAY对此不承担任何责任。</p>
            <p>3.3 您了解使用VAT服务时，经CaresPAY审核通过的资料仍需提交当地税务局审批。您了解您的资料存在被当地税务局拒绝的风险，您同意承担由此导致的损失，CaresPAY对此不承担任何责任。</p>
            <p>3.4 为保证VAT服务的质量，CaresPAY可能通过与第三方机构合作来为您提供服务；您了解并同意CaresPAY通过第三方机构为您提供VAT服务。</p>
            <p>3.5 您须按照当地税务局规定的会计期内缴纳VAT款项，若您违反前述保证而导致的损失，CaresPAY对此不承担任何责任。若您违反前述保证而导致CaresPAY遭受任何损失，您须赔偿CaresPAY因此遭受的全部损失。</p>
            <p>3.6 您在使用VAT服务时须遵守法律法规，不得利用VAT服务从事违法违规行为。如果您违反了本条约定使CaresPAY遭受任何损失，您须赔偿CaresPAY因此遭受的全部损失。</p>
            <p>3.7 您理解并同意，在使用VAT服务的过程中，可能会遇到不可抗力等风险因素，使服务发生中断或终止。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为、法律或政策调整、平台规则调整、金融机构政策调整等。出现上述情况时，CaresPAY在法律允许的范围内免责。</p>
            <p>四、服务的变更、中断、终止</p>
            <p>4.1 CaresPAY可能会对VAT服务的服务内容进行变更，也可能会中断、中止或终止VAT服务的部分或全部服务。</p>
            <p>4.2 如发生下列任何一种情形，CaresPAY有权暂停或终止向您提供服务：（1）您违反相关法律法规或本协议的约定；（2）按照法律规定或主管部门的要求；（3）出于安全的原因或其他CaresPAY认为必要的情形。</p>
            <p>4.3 您理解并同意，CaresPAY有权自主决定经营策略。在发生合并、分立、收购、资产转让时，CaresPAY可向第三方转让VAT服务下相关资产；CaresPAY也可在单方通知您后，将本协议下部分或全部服务转交由第三方运营或履行。</p>
            <p>4.4 您理解并同意，若您未能及时足额支付服务费，CaresPAY有权中断、中止或终止VAT服务。</p>
            <p>五、知识产权</p>
            <p>5.1 CaresPAY在VAT服务中提供的内容（包括但不限于网页、文字、图片、音频、视频、图表等）的知识产权归CaresPAY所有。除另有特别声明外，CaresPAY提供VAT服务的服务时所依托软件的著作权、专利权及其他知识产权均归CaresPAY所有。</p>
            <p>5.2 CaresPAY在VAT服务中所使用的“CaresPAY”等商业标识，其著作权或商标权归CaresPAY所有。</p>
            <p>5.3 上述及其他任何VAT服务包含的内容的知识产权均受到法律保护，未经CaresPAY或相关权利人书面许可，任何人不得以任何形式进行使用或创造相关衍生作品。</p>
            <p>六、其他条款</p>
            <p>6.1 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。</p>
            <p>6.2 若发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交杭州仲裁委员会按照该仲裁委员会届时有效的仲裁规则进行裁决。</p>
            <p>6.3 本协议涉及的术语含义及未作约定的事宜，以您开立CaresPAY账户时同意的《CaresPAY服务协议》为准；若《CaresPAY服务协议》与本协议存在冲突部分，以本协议为准。</p>
            <p>6.4 附件作为本协议不可分割一部分，与本协议正文具有同等效力。</p>
            <p>6.5 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</p>
            <p>6.6 本协议中的标题仅为方便而设，在解释本协议时应被忽略，不能作为本协议条款解释的依据。</p>
       </div>

        <div class="btn">
            <span class="cares-button-primary" @click="serviceButtonEvent(true)">同意</span><br/>
            <span @click="serviceButtonEvent(false)" class="ING">不同意</span>
        </div>
    </AdminModel>
</template>

<script>
import AdminModel from './../../../../components/adminModel.vue';

export default {
    data(){
        return{
            flag:false
        }
    },
    props:['value','buttonEvent'],
    created(){
        this.flag = this.value;
    },
    watch:{
        value(bol){
            this.flag = bol
        }
    },
    components:{
        AdminModel
    },
    methods:{
        serviceButtonEvent(bol){
            this.$emit('input',false);
            this.buttonEvent(bol)
        }
    }
}
</script>

<style lang="scss">
.vat-service-model{
    .modal-container {
         .vat-service-container{
            max-height: 400px;
            overflow-y: scroll;
        }
    }
       
}
</style>
