<template>
    <div class="banner text-page">
       <h2>CaresPAY隐私政策</h2>
       <p>CaresPAY(“我们”)非常重视您的隐私，您在使用我们的服务时，我们可能会收集和使用您的相关信息，因此我们制定了涵盖如何收集、使用以及存储你的信息的《CaresPAY隐私政策》(“本政策”)。本政策与您使用我们的服务关系紧密，我们强烈建议您仔细阅读并理解本政策全部内容，做出您认为适当的选择。请花些时间熟悉我们针对客户隐私的做法，如有任何疑问，请及时与我们联系沟通。</p>
       <p>为了让您可以正常使用CaresPAY服务，我们需要按照相关法规要求进行实名制管理、履行反洗钱职责、采取风险防范措施。收集、存储、使用您的信息，是出于遵守国家法律法规的规定、向您提供服务及提升服务质量的需要。</p>
       <br/>
       <br/>
       <h3>CaresPAY严格遵守以下基本原则</h3>
       <div>1.&nbsp;&nbsp; 除非我们真正需要，否则我们不会要求您提供个人信息。</div>
       <div>2.&nbsp;&nbsp; 我们不与他人共享您的任何个人数据，除因遵守法律、提供我们的服务或保护我们的权利而需要共享的情况外。</div>
       <div>3.&nbsp;&nbsp; 除了向您提供服务的员工和授权的服务供应商外，我们将限制任何其他第三方访问您的个人信息。</div>
       <div>4.&nbsp;&nbsp; 我们维护物理的，电子的和流程上的安全协议，以保护您的个人信息。</div>
       <div>5.&nbsp;&nbsp; 根据法律要求，我们将在本政策告知您我们是如何收集、共享和保护您的个人信息。请在注册CaresPAY账号并向我们提供您的个人信息之前，详细阅读本隐私政策。同时，该隐私政策也充分遵照中国有关法律法规的相关规定。</div>
       <div>6.&nbsp;&nbsp; 如果您对CaresPAY的数据保护存在任何其他疑问，请立即联系我们的客户服务部门，我们将尽可能解答您的疑惑。</div>
       <br/>
       <br/>
       <h3>我们可能收集的信息</h3>
       <p>我们提供服务时，可能会收集、存储和使用下列与您有关的信息。如果您不提供相关信息，可能无法注册成为我们的用户或无法享受我们提供的某些服务，或者无法达到相关服务拟达到的效果：</p>
       <div>1.&nbsp;&nbsp; 您在注册账户或使用我们的服务时，向我们提供的相关个人信息，如电话号码、电子邮件、身份证件信息或银行卡信息等；</div>
       <div>2.&nbsp;&nbsp; 您使用我们的服务时所产生并存储的技术信息。</div>
       <br>
       <br>
       <h3>网站访客制度</h3>
       <p>为了更好地了解CaresPAY访客的网站使用行为，CaresPAY会收集一般情况下由网页浏览器和服务器生成的非个人识别信息，如浏览器类型，语言偏好及每条访客请求的日期和时间。CaresPAY可能会不定期公布总体的非个人识别信息，例如，发布关于其网站使用趋势的报告。</p>
       <div>CaresPAY还会收集潜在的个人识别信息，如登录用户的互联网协议（IP）地址等。</div>
       <br>
       <br>
       <h3>收集个人识别信息</h3>
       <p>CaresPAY将根据网站访客选择的与CaresPAY互动的性质需要，决定收集个人识别信息的数量与类型。例如，注册CaresPAY帐户的访客必要时还需要提供包括处理任何通过我们执行的交易所需的个人和财务信息。访客有权拒绝提供个人识别信息，但这可能导致无法继续使用CaresPAY的服务。当您的帐户有更新或需要通知您有关我们产品变化、改进或促销的资讯时，我们可能会使用您的个人信息与您联系。</p>
       <p>我们将不排除通过其他来源收集您的个人信息，如信用机构、公共记录或其他公司。</p>
        <br>
        <br>
        <h3>保护部分个人识别信息</h3>
        <p>CaresPAY公开潜在个人识别信息和个人识别信息的对象仅限于其（1）需要知道这些信息以便对其进行处理或提供服务，以及（2）已同意不向他人透露该信息的雇员、服务提供商和联属机构。这些雇员、服务提供商及联属机构有些可能不在您的国内。出于满足法律要求以帮助预防犯罪或其他合法目的，我们还可能需要与政府部门、监管机构、警察/执法机构或法院共享您的信息。</p>
        <p>如果您是CaresPAY网站的注册用户并提供了您的电子邮件地址，CaresPAY将通过电子邮件通知您任何帐户通信状况。为提升用户体验，网站也会偶尔给您发送一封电子邮件，向您告知新的功能，征求您的反馈，或让您及时了解CaresPAY产品服务的最新情况。</p>
        <div>对于潜在个人识别信息和个人识别信息，CaresPAY会采取一切合理的措施来防止未经授权的访问、使用、更改或破坏。这些措施包括启用计算机防护系统和安全文件。CaresPAY不会向任何人出租或出售任何个人识别信息。</div>
        <p>我们会出于安全与培训目的对我们与客户之间的电话进行录音。</p>
        <br>
        <br>
        <h3>Cookies的使用</h3>
        <p>1.&nbsp;&nbsp;为实现您联机体验的个性化需求，使您获得更轻松的访问体验。我们会在您的计算机或移动设备上发送一个或多个名为Cookies的小数据文件，指定给您的Cookies是唯一的，它只能被将Cookies发布给您的域中的Web服务器读取。我们向您发送Cookies是为了简化您重复登录的步骤、帮助判断您的登录状态以及账户或数据安全。</p>
        <p>2.&nbsp;&nbsp;我们不会将Cookies用于本隐私政策所述目的之外的任何用途。您可根据自己的偏好管理或删除Cookies。您可以清除计算机上保存的所有Cookies，大部分网络浏览器会自动接受Cookies，但您通常可根据自己的需要来修改浏览器的设置以拒绝Cookies；另外，您也可以清除软件内保存的所有Cookies。但如果您这么做，您可能需要在每一次访问CaresPAY网站时亲自更改用户设置，而且您之前所记录的相应信息也均会被删除，并且可能会对您所使用服务的安全性有一定影响。</p>
        <br>
        <br>
        <h3>隐私政策更改制度</h3>
        <p>CaresPAY有权随时根据需要更改隐私政策。如果我们对收集、保护或使用您个人信息的方式做出重大改变的话，我们将会在我们网站上以显要通告的方式告知您。CaresPAY鼓励您经常查看本页面，以便了解任何本政策的更改。在本隐私政策进行任何更改之后您继续使用CaresPAY服务，则视为您已接受更改。</p>
        <br>
        <br>
        <h3>隐私问题和承诺</h3>
        <p>为确保您个人信息的安全，我们向全体CaresPAY员工传达了公司的隐私安全准则，并在公司内部严格执行隐私保护的措施。</p>
        <p>如果您对CaresPAY的隐私政策或数据处理有任何疑问，您可以随时通过网站公示的客服联系方式，与我们取得联系。</p>

         <h3 class="company-name">凯蓝仕金融服务（深圳）有限公司</h3>
    </div>
</template>

<script>
export default {
  data() {
    return {};
  },
  mounted() {
    let header = document.getElementsByTagName(`header`);
    let footer = document.getElementsByTagName(`footer`);
    header[0].style.display = `none`;
    footer[0].style.display = `none`;
  }
};
</script>

<style lang="scss" scoped>
    h3{
        font-size: 20px;
        color: #4F81BD;
    }
</style>

